# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis_clean.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing first data cleaning, formatting, and structuring.

In [5]:
# your code goes here
import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv")

1. Create a new DataFrame that only includes customers who have a total_claim_amount greater than $1,000 and have a response of "Yes" to the last marketing campaign. How many customers were there?

In [6]:
# Filter the data to only include customers with a total_claim_amount greater than $1,000 and a response of "Yes"
high_claim_yes_responses = df[(df['total_claim_amount'] > 1000) & (df['response'] == 'Yes')]
high_claim_yes_responses.head(1)

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
189,189,OK31456,California,11009.13049,Yes,Premium,Bachelor,2011-01-24,Employed,F,...,1,Corporate Auto,Corporate L3,Offer2,Agent,1358.4,Luxury Car,Medsize,A,1

2. Using the original dataframe, analyze the average total_claim_amount by each policy type and gender for customers who have responded "Yes" to the last marketing campaign. Write your conclusions.

In [7]:
# Filter the data to only include customers who responded "Yes"
yes_responses = df[df['response'] == 'Yes']

# Group the data by policy type and gender and calculate the mean of total_claim_amount
yes_responses.groupby(['policy_type', 'gender'])['total_claim_amount'].mean()

policy_type     gender
Corporate Auto  F         433.738499
                M         408.582459
Personal Auto   F         452.965929
                M         457.010178
Special Auto    F         453.280164
                M         429.527942
Name: total_claim_amount, dtype: float64

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

In [8]:
# Group the data by state and count the number of customers in each group
customers_by_state = df.groupby('state')['customer'].count().reset_index()

# Filter the data to only include states with more than 100 customers
states_over_100_customers = customers_by_state[customers_by_state['customer'] > 500]
states_over_100_customers

        state  customer
0     Arizona      1937
1  California      4183
2      Nevada       993
3      Oregon      2909
4  Washington       888

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

In [9]:
df.groupby(['education', 'gender'])['customer_lifetime_value'].agg(['max', 'min', 'median'])

                                     max          min       median
education            gender
Bachelor             F       73225.95652  1904.000852  5640.505303
                     M       67907.27050  1898.007675  5548.031892
College              F       61850.18803  1898.683686  5623.611187
                     M       61134.68307  1918.119700  6005.847375
Doctor               F       44856.11397  2395.570000  5332.462694
                     M       32677.34284  2267.604038  5577.669457
High School or Below F       55277.44589  2144.921535  6039.553187
                     M       83325.38119  1940.981221  6286.731006
Master               F       51016.06704  2417.777032  5729.855012
                     M       50568.25912  2272.307310  5579.099207

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month.

Present the data in a table where the months are arranged as columns and the states are arranged as rows.

In [10]:
# Group the data by state and month and count the number of policies sold
grouped = df.groupby(['state', 'month']).size()

# Unstack the month index to create a table
table = grouped.unstack()

table

month          1     2
state
Arizona     1008   929
California  2231  1952
Nevada       551   442
Oregon      1565  1344
Washington   463   425

6. Display a new DataFrame that contains the number of policies sold by month by state for the top 3 states with the highest number of policies sold.

*Hint:* 
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

In [11]:
# Group the data by state and month and count the number of policies sold for each group
state_month_policies = df.groupby(['state', 'month'])['number_of_policies'].count().reset_index()

# Sort the data by the count of policies sold
state_month_policies_sorted = state_month_policies.sort_values(by='number_of_policies', ascending=False)

# Select the top 3 states with the highest number of policies sold
top_states = state_month_policies_sorted['state'].unique()[:3]

# Create a new DataFrame that contains the number of policies sold by month for each of the top 5 states
top_states_policies = state_month_policies_sorted[state_month_policies_sorted['state'].isin(top_states)]
top_states_policies

        state  month  number_of_policies
2  California      1                2231
3  California      2                1952
6      Oregon      1                1565
7      Oregon      2                1344
0     Arizona      1                1008
1     Arizona      2                 929

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

In [ ]:
df['response'] = df['response'].apply(lambda x: 1 if x=='Yes' else 0) #careful, this line
# should only be run once, otherwise, the second time is run every value will be 0

# Melt the data to convert columns to rows
melted_table = pd.melt(df, id_vars=['sales_channel'], value_vars=['response'])
melted_table

In [ ]:
# Calculate the response rate by sales channel
response_rate_table = melted_table.groupby('sales_channel')['value'].sum().reset_index()
response_rate_table